code/app/Controllers/Home.php

UPDATE `usuarios` SET `nombre` = 'Juan Javi', `apellido` = 'Perez Chableo', `correo` = 'migue@gmail.com', `rol` = '0', `contra` = 'SASA'
WHERE `usuarios`.`id_usuario` IN ('1')
---
    public function actualizarRegistro(){
        $mFacturas = new mFacturas();
        $id_usuario = $_POST['id_usuario'];
        $usuarioActualizado = [
            "nombre" => $_POST['nombre'],
            "apellido" => $_POST['apellido'],
            "correo" => $_POST['correo'],
            "rol" => $_POST['rol'],
            "contra" => $_POST['contra']
        ];
        $mFacturas->update($id_usuario, $usuarioActualizado);

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '1'
---
    public function buscarRegistro(){
        $mFacturas = new mFacturas();
        $id_usuario = $_POST['id_usuario'];
        $usuario=$mFacturas->find($id_usuario);